tjwink/ART-Pi-WICED-AP6212a/STM32H750_AP6181_NoOS_NoNS_190316/User/main.c
/**
  ******************************************************************************
  * @file    main.c
  * @author  fire
  * @version V1.0
  * @date    2017-xx-xx
  * @brief   BCM43362WIFI裸机驱动程序
  ******************************************************************************
  * @attention
  *
  * 实验平台:野火  STM32 H750 开发板
  * 论坛    :http://www.firebbs.cn
  * 淘宝    :http://firestm32.taobao.com
  *
  ******************************************************************************
  */
  
/*
 * Broadcom Proprietary and Confidential. Copyright 2016 Broadcom
 * All Rights Reserved.
 *
 * This is UNPUBLISHED PROPRIETARY SOURCE CODE of Broadcom Corporation;
 * the contents of this file may not be disclosed to third parties, copied
 * or duplicated in any form, in whole or in part, without the prior
 * written permission of Broadcom Corporation.
 */

/** @file
 *
 * Canned UDP Send App
 *
 * Features demonstrated
 *  - Direct WWD driver access (bypasses WICED API)
 *  - No RTOS / No Network Stack
 *
 * This application demonstrates how to use the Broadcom Wi-Fi device
 * to send pre-constructed UDP packets without the use of an RTOS or
 * Network Stack.
 *
 * The application is designed to have a minimal memory footprint
 *
 * Application Instructions
 *   1. Modify the AP_SSID/AP_PASS directives in the application code below
 *      to match your access point
 *   2. Connect a PC terminal to the serial port of the WICED Eval board,
 *      then build and download the application as described in the WICED
 *      Quick Start Guide
 *
 *   The app connects to the AP and sends a UDP packet once per second to
 *   the IP address specified by the PKT_TARGET_IP address
 *
 * *** IMPORTANT NOTE ***
 *   In release builds all UART printing is TURNED OFF to remove
 *   printf and malloc dependency. This reduces memory usage
 *   dramatically!!
 *
 */

#include "platform/wwd_platform_interface.h"
#include "wwd_management.h"
#include "network/wwd_buffer_interface.h"
#include "network/wwd_network_interface.h"
#include "network/wwd_network_constants.h"
#include "RTOS/wwd_rtos_interface.h"
#include "wwd_wifi.h"
#include "wwd_poll.h"
#include <string.h>  /* for NULL */
#include "NoOS_canned_send.h"
#include "wwd_debug.h"

#include "stm32h7xx.h"
#include "usart/bsp_debug_usart.h"
#include "led/bsp_led.h"

/******************************************************
 *                      Macros
 ******************************************************/

/******************************************************
 *                    Constants
 ******************************************************/
#define AP_SSID             "Embedfire"
#define AP_PASS             "12345678"
#define AP_SEC              WICED_SECURITY_WPA2_MIXED_PSK
#define COUNTRY             WICED_COUNTRY_CHINA
#define JOIN_TIMEOUT        (10000)                                  /* timeout for joining the wireless network in milliseconds  = 10 seconds */
#define IP_ADDR             MAKE_IPV4_ADDRESS( 192, 168, 1,  188 )
#define LOCAL_UDP_PORT      (50007)
#define PKT_TARGET_IP       MAKE_IPV4_ADDRESS( 255, 255, 255, 255)  /* For unicast, change address e.g. MAKE_IPV4_ADDRESS( 192, 168, 1,   5 ) */
#define PKT_TARGET_UDP_PORT (50007)
#define MAX_PAYLOAD         (100) /* bytes */
#define PAYLOAD             "BCM43362WIFI裸机驱动程序，无系统，无协议栈，直接UDP发送数据!"

/* In release builds all UART printing is TURNED OFF to remove printf and malloc dependency which reduces memory usage dramatically */
#ifndef DEBUG
#undef  WPRINT_APP_INFO
#define WPRINT_APP_INFO(args)
#endif



/******************************************************
 *                   Enumerations
 ******************************************************/

/******************************************************
 *                 Type Definitions
 ******************************************************/

/******************************************************
 *                    Structures
 ******************************************************/

/******************************************************
 *               Static Function Declarations
 ******************************************************/
/** @cond */
static void  resolve_dest_mac   ( uint32_t dest_ip_addr, wiced_mac_t * MAC_buffer );
static void  send_canned_packet ( char* pkt, uint16_t payload_len );
static char* setup_canned_packet( char *        pkt,
                                  uint16_t      pkt_len,
                                  uint32_t      my_ip_addr,
                                  wiced_mac_t * my_MAC,
                                  uint32_t      dest_ip_addr,
                                  wiced_mac_t * dest_MAC,
                                  uint16_t      src_udp_port,
                                  uint16_t      dest_udp_port );

/******************************************************
 *               Variable Definitions
 ******************************************************/

static wiced_mac_t   my_mac             = { {0x12,0x34,0x56,0x78,0x11,0x22} };
static wiced_mac_t   broadcast_mac      = { {0xff,0xff,0xff,0xff,0xff,0xff} };
static uint8_t       arp_complete       = 0;
static wiced_mac_t*  arp_mac_buffer_ptr = 0;
static uint32_t      arp_dest_ip_addr   = 0;
static uint32_t      my_ip_addr         = IP_ADDR;
static char          pkt_buffer[ ((MAX( PACKET_SIZE, MIN_IOCTL_BUFFER_SIZE )+63)&(~63))+4 ];
static const wiced_ssid_t ap_ssid =
{
    .length = sizeof(AP_SSID)-1,
    .value  = AP_SSID,
};

/** @endcond */


/******************************************************
 *               Variable Definitions
 ******************************************************/
static void MPU_Config(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct;

  /* Disable the MPU */
  HAL_MPU_Disable();

  /* Configure the MPU attributes as WT for SRAM */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.BaseAddress = 0x24000000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_512KB;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_CACHEABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER0;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.SubRegionDisable = 0x00;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /* Configure the MPU attributes as WT for D3 SRAM */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.BaseAddress = 0x38000000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_64KB;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_CACHEABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER1;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.SubRegionDisable = 0x00;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /* Enable the MPU */
  HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);
}
/**
  * @brief  System Clock Configuration
  *         The system Clock is configured as follow :
  *            TODO : Fill the table below
  *            System Clock source            =
  *            SYSCLK(Hz)                     =
  *            HCLK(Hz)                       =
  *            AHB Prescaler                  =
  *            APB1 Prescaler                 =
  *            APB2 Prescaler                 =
  *            HSE Frequency(Hz)              =
  *            PLL_M                          =
  *            PLL_N                          =
  *            PLL_P                          =
  *            PLL_Q                          =
  *            VDD(V)                         =
  *            Main regulator output voltage  =
  *            Flash Latency(WS)              =
  * @param  None
  * @retval None
  */
static void system_clock_config(void)
{
    RCC_ClkInitTypeDef rcc_clock_init_struct;
    RCC_OscInitTypeDef rcc_oscillator_init_struct;
    RCC_PeriphCLKInitTypeDef RCC_PeriphClkInit;
    uint32_t flash_latency;

    /* Enable use of Floating point instructions */
#if (__FPU_PRESENT == 1) && (__FPU_USED == 1)
    SCB->CPACR |= ((3UL << 10*2)|(3UL << 11*2));  /* set CP10 and CP11 Full Access */
#endif

