tjwink/ART-Pi-WICED-AP6212a/STM32H750_AP6181_NoOS_NoNS_190316/User/main.c
    /*!< Supply configuration update enable */
    MODIFY_REG(PWR->CR3, PWR_CR3_SCUEN, 0);

    /* The voltage scaling allows optimizing the power consumption when the device is
       clocked below the maximum system frequency, to update the voltage scaling value
       regarding system frequency refer to product datasheet.  */
    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    while ((PWR->D3CR & (PWR_D3CR_VOSRDY)) != PWR_D3CR_VOSRDY) {}

    HAL_RCC_GetOscConfig(&rcc_oscillator_init_struct);

    if(rcc_oscillator_init_struct.HSEState != RCC_HSE_ON || rcc_oscillator_init_struct.PLL.PLLSource != RCC_PLLSOURCE_HSE)
    {
        /* Enable HSE Oscillator and activate PLL with HSE as source */
        rcc_oscillator_init_struct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
        rcc_oscillator_init_struct.HSEState       = RCC_HSE_ON;
        rcc_oscillator_init_struct.LSIState       = RCC_LSI_ON;
        rcc_oscillator_init_struct.LSEState       = RCC_LSE_ON;
        rcc_oscillator_init_struct.HSIState       = RCC_HSI_DIV1;
        rcc_oscillator_init_struct.PLL.PLLState   = RCC_PLL_ON;
        rcc_oscillator_init_struct.PLL.PLLSource  = RCC_PLLSOURCE_HSE;
        rcc_oscillator_init_struct.PLL.PLLM       = 5;
        rcc_oscillator_init_struct.PLL.PLLN       = 160;
        rcc_oscillator_init_struct.PLL.PLLP       = 2;
        rcc_oscillator_init_struct.PLL.PLLR       = 2;
        rcc_oscillator_init_struct.PLL.PLLQ       = 4;
        rcc_oscillator_init_struct.PLL.PLLRGE     = RCC_PLL1VCIRANGE_2;
        rcc_oscillator_init_struct.PLL.PLLVCOSEL  = RCC_PLL1VCOWIDE;
        rcc_oscillator_init_struct.PLL.PLLFRACN   = 0;
        rcc_oscillator_init_struct.HSICalibrationValue = 16;

        if(HAL_RCC_OscConfig(&rcc_oscillator_init_struct) != HAL_OK)
        {
            /* Initialization Error */

        }
    }

    HAL_RCC_GetClockConfig(&rcc_clock_init_struct, &flash_latency);
    if(rcc_clock_init_struct.SYSCLKSource   != RCC_SYSCLKSOURCE_PLLCLK)
    {
        /**Initializes the CPU, AHB and APB busses clocks
        */
        rcc_clock_init_struct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                                    |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2
                                    |RCC_CLOCKTYPE_D3PCLK1|RCC_CLOCKTYPE_D1PCLK1;

        rcc_clock_init_struct.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
        rcc_clock_init_struct.SYSCLKDivider  = RCC_SYSCLK_DIV1;
        rcc_clock_init_struct.AHBCLKDivider  = RCC_HCLK_DIV2;
        rcc_clock_init_struct.APB3CLKDivider = RCC_APB3_DIV2;
        rcc_clock_init_struct.APB1CLKDivider = RCC_APB1_DIV2;
        rcc_clock_init_struct.APB2CLKDivider = RCC_APB2_DIV2;
        rcc_clock_init_struct.APB4CLKDivider = RCC_APB4_DIV2;

        if(HAL_RCC_ClockConfig(&rcc_clock_init_struct, FLASH_LATENCY_4) != HAL_OK)
        {
            /* Initialization Error */

        }

        RCC_PeriphClkInit.PeriphClockSelection      = RCC_PERIPHCLK_USART1 | RCC_PERIPHCLK_USART2;
        RCC_PeriphClkInit.Usart16ClockSelection     = RCC_USART16CLKSOURCE_HSI;
        RCC_PeriphClkInit.Usart234578ClockSelection = RCC_USART234578CLKSOURCE_HSI;
        HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphClkInit);
    }
    else
    {
        /* HAL_RCC_ClockConfig() is not called, call below two functions to update
         * STM32 HAL Global variables.
         */

        /* Update SystemCoreClock in STM32 HAL */
        SystemCoreClockUpdate();

        /* Update SystemD2Clock in STM32 HAL */
        HAL_RCC_GetHCLKFreq();
    }

    /* Configure the Systick interrupt time */
    HAL_SYSTICK_Config(SystemCoreClock/1000);

    /* Configure the Systick */
    HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

    /* define MEASURE_CLOCK_FREQUENCY to measure clock frequency
     * on RCC_MCO1 and RCC_MCO2 pins.
     */
#ifdef MEASURE_CLOCK_FREQUENCY
    HAL_RCC_MCOConfig(RCC_MCO1, RCC_MCO1SOURCE_HSE, RCC_MCODIV_1);
    HAL_RCC_MCOConfig(RCC_MCO2, RCC_MCO2SOURCE_SYSCLK, RCC_MCODIV_10);
#endif
}
/******************************************************
 *               Function Definitions
 ******************************************************/

/**
 * Main function of canned UDP packet send application
 *
 * This main function initializes Wiced, joins a network,
 * requests the destination address via an ARP, then repeatedly
 * sends a UDP packet.
 */

int main( void )
{
    wiced_mac_t dest_mac = { {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF} };
    char* payload_ptr = 0;
    wwd_result_t result;

    MPU_Config();
		
    /* Enable I-Cache */
    SCB_EnableICache();

    /* Enable D-Cache */
    SCB_EnableDCache();
		
	  system_clock_config();    
    /* 初始化LED灯 */
    LED_GPIO_Config();
		LED_BLUE;	
  
    /*初始化USART1*/
    DEBUG_USART_Config();
  
		printf("\r\n欢迎使用野火  STM32H750 开发板。\r\n");
    
    NoOS_setup_timing( );

    WPRINT_APP_INFO(("\nPlatform " PLATFORM " initialised\n"));

    nons_buffer_init_t pkt_buff_init = { pkt_buffer, sizeof( pkt_buffer ) };
    wwd_buffer_init( &pkt_buff_init );

    result = wwd_management_wifi_on( COUNTRY );
    if ( result != WWD_SUCCESS )
    {
        WPRINT_APP_INFO(("Error %d while starting WICED!\n", result));
    }

    /* Get MAC address - this needs to be done before joining a network, so that */
    /* we can check the address of any incoming packets against our MAC */
    wwd_wifi_get_mac_address( &my_mac, WWD_STA_INTERFACE );
    
    /* Attempt to join the Wi-Fi network */
    WPRINT_APP_INFO(("Joining : " AP_SSID "\n"));
    while ( wwd_wifi_join( &ap_ssid, AP_SEC, (uint8_t*) AP_PASS, sizeof( AP_PASS ) - 1, NULL ) != WWD_SUCCESS )
    {
        WPRINT_APP_INFO(("Failed to join  : " AP_SSID "   .. retrying\n"));
    }
    WPRINT_APP_INFO(("Successfully joined : " AP_SSID "\n"));

    if ( PKT_TARGET_IP != 0xFFFFFFFF )  /* Check if the target has a broadcast address */
    {
        /* Send an ARP request to resolve the destination IP address into a MAC address */
        resolve_dest_mac( PKT_TARGET_IP, &dest_mac );
    }

    /* Loop forever, repeatedly sending the UDP packet */
    while ( 1 )
    {
        int i;

        /* Setup the packet buffer with the canned packet contents. */
        payload_ptr = setup_canned_packet( pkt_buffer, sizeof( pkt_buffer ), my_ip_addr, &my_mac, PKT_TARGET_IP, &dest_mac, LOCAL_UDP_PORT, PKT_TARGET_UDP_PORT );

        /* Copy the payload into the packet */
        memcpy( payload_ptr, PAYLOAD, sizeof( PAYLOAD ) - 1 );

        WPRINT_APP_INFO(("Sending "PAYLOAD"\n"));
        send_canned_packet( pkt_buffer, sizeof( PAYLOAD ) - 1 );

        for ( i = 0; i < 10; i++ )
        {
            host_rtos_delay_milliseconds( 100 );
            /* Poll for packets to receive (which will be dropped) - 802.11 device will run out of memory if packets are not read out of it */
            while ( wwd_thread_poll_all( ) != 0 )
            { }
        }
    }
}





/**
 * Resolves an IP address using ARP
 *
 * Creates and sends a ARP request packet, then waits
 * for the response.
 *
 * @Note : Currently there is no provision for timeouts/retries
 *
 * @param dest_ip_addr : the destination IP address in network endian format (little endian)
 * @param MAC_buffer   : pointer to a MAC address structure which will receive the resolved
 *                       MAC address of the destination IP
 */
static void resolve_dest_mac( uint32_t dest_ip_addr, wiced_mac_t * MAC_buffer )
{
    /* Template for ARP request packet */
    static const arp_packet_t arp_template =
    {
        .ethernet_header =
        {
            { { 0xff, 0xff, 0xff, 0xff, 0xff, 0xff } },
            { { 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 } },
            SWAP16( ETHER_TYPE_ARP )
        },
        .arp_message =
        {
            SWAP16( ARP_HARDWARE_TYPE_ETHERNET ),
            SWAP16( ARP_PROTOCOL_TYPE_IPV4 ),
            6,
            4,
            SWAP16( ARP_OPERATION_REQUEST ),
            { { 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 } },
            0x00000000,
            { { 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 } },
            0x00000000,
        }
    };

    do
    {
        int pollcount = 0;

        WPRINT_APP_INFO(("Sending ARP request\n"));
        arp_packet_t* pkt = (arp_packet_t*)pkt_buffer;
        memcpy(pkt, &arp_template, sizeof(arp_packet_t));

        /* Fill missing fields into ARP request template */
        memcpy( &pkt->ethernet_header.source,              &my_mac, 6 );
        memcpy( &pkt->arp_message.sender_hardware_address, &my_mac, 6 );
        pkt->arp_message.sender_protocol_address = my_ip_addr;
        pkt->arp_message.target_protocol_address = dest_ip_addr;

        /* Set the current size of the packet */
        host_buffer_set_size( (wiced_buffer_t)pkt,  sizeof(arp_packet_t) - sizeof(wwd_buffer_header_t) );

