tjwink/ART-Pi-WICED-AP6212a/STM32H750_AP6181_NoOS_NoNS_190316/User/main.c
        /* Queue the packet in the transmit queue */
        wwd_network_send_ethernet_data( (wiced_buffer_t) &pkt->ethernet_header, WWD_STA_INTERFACE );

        /* Setup global variables to allow the ARP response processing to compare against */
        arp_mac_buffer_ptr = MAC_buffer;
        arp_dest_ip_addr = dest_ip_addr;

        /* Send and receive packets until the ARP transaction has completed */
        while ( ( arp_complete != 1 ) && ( pollcount < 10000 ) )
        {
            wwd_thread_poll_all( );
            pollcount++;
        }
        pollcount = 0;
    } while ( arp_complete != 1 );

    /* Reset global variable so incoming ARP packets won't be processed */
    arp_mac_buffer_ptr = 0;

}


/**
 * Creates a canned UDP packet
 *
 * This function creates an empty UDP packet in the given packet buffer
 *
 * @param pkt           : the packet buffer in which the UDP packet will be created
 * @param pkt_len       : the maximum length of pkt (the packet buffer)
 * @param my_ip_addr    : the local IP address in network format (little endian)
 * @param my_MAC        : the local MAC address
 * @param dest_ip_addr  : the destination IP address in network format (little endian)
 * @param dest_MAC      : the destination MAC address
 * @param src_udp_port  : the local UDP port to use
 * @param dest_udp_port : the remote UDP port at the destination
 *
 * @return A pointer to the location where the UDP payload should be copied.
 */
static char* setup_canned_packet( char *        pkt,
                                  uint16_t      pkt_len,
                                  uint32_t      my_ip_addr,
                                  wiced_mac_t *   my_MAC,
                                  uint32_t      dest_ip_addr,
                                  wiced_mac_t *   dest_MAC,
                                  uint16_t      src_udp_port,
                                  uint16_t      dest_udp_port )
{
    udp_packet_t *      udp_pkt = (udp_packet_t*) pkt;
    ethernet_header_t * eth     = &udp_pkt->ethernet_header;
    ipv4_header_t *     iphdr   = &udp_pkt->ip_header;
    udp_header_t *      udphdr  = &udp_pkt->udp_header;

    /* Clear packet */
    memset( pkt, 0, pkt_len );

    /* Setup Ethernet header */
    memcpy( &eth->source, my_MAC, 6 );
    memcpy( &eth->destination, dest_MAC, 6 );
    eth->ether_type = SWAP16( ETHER_TYPE_IPv4 );

    /* Setup IP header
     * Cannot setup total_length or checksum at this stage
     * The following fields are left zero : differentiated_services, identification
     */
    iphdr->header_length         = 5; /* IP header is 5 x 32bits long */
    iphdr->version               = 4; /* IPv4 */
    iphdr->flags_fragment_offset = 2 << 5;
    iphdr->time_to_live          = 128;
    iphdr->protocol              = 0x11; /* UDP protocol */
    iphdr->source_address        = my_ip_addr;
    iphdr->destination_address   = dest_ip_addr;

    /* Setup UDP header
     * Cannot setup udp_lengthat this stage
     * Checksum field left zero to disable UDP checksum
     */
    udphdr->source_port = SWAP16( src_udp_port );
    udphdr->dest_port   = SWAP16( dest_udp_port );

    /* Return the start address of the UDP payload, so the caller can copy their payload in. */
    return udp_pkt->data;
}


/**
 * Send the canned UDP packet
 *
 * Adds the packet length to the IP and UDP headers, then calculates the IP header
 * checksum.
 *
 * @param pkt         : the packet buffer to be sent
 * @param payload_len : the length of the UDP payload data in bytes
 *
 */

static void send_canned_packet( char* pkt, uint16_t payload_len )
{
    udp_packet_t *  udp_pkt       = (udp_packet_t*) pkt;
    ipv4_header_t * iphdr         = &udp_pkt->ip_header;
    udp_header_t *  udphdr        = &udp_pkt->udp_header;
    uint32_t     checksum_temp = 0;
    uint8_t      i;

    /* Add packet length to IP and UDP headers */
    iphdr->total_length = SWAP16( sizeof(ipv4_header_t) + sizeof(udp_header_t) + payload_len );
    udphdr->udp_length  = SWAP16(                         sizeof(udp_header_t) + payload_len );

    /* Calculate the IP header checksum */
    iphdr->header_checksum = 0;
    for ( i = 0; i < ( sizeof(ipv4_header_t) ); i += 2 )
    {
        checksum_temp += ( ( (unsigned char*) iphdr )[i] << 8 ) | ( ( (unsigned char*) iphdr )[i + 1] );
    }
    while ( checksum_temp >> 16 )
    {
        checksum_temp = ( checksum_temp & 0xFFFF ) + ( checksum_temp >> 16 );
    }
    iphdr->header_checksum = SWAP16( (uint16_t)(~checksum_temp) );


    /* Set the packet size */
    host_buffer_set_size( pkt, sizeof(ethernet_header_t) + sizeof(ipv4_header_t) + sizeof(udp_header_t) + payload_len );

    /* Send the packet */
    wwd_network_send_ethernet_data( (wiced_buffer_t) &udp_pkt->ethernet_header, WWD_STA_INTERFACE );
    wwd_thread_send_one_packet( ); /* Send packet only - do not poll all, since that would cause receives which will overwrite packet buffer contents */
}


/**
 * Processes incoming received packets
 *
 * This function is called as a callback by Wiced when a packet has been
 * received.
 * For this example application, the only kind of packet of interest is
 * an ARP response from the destination IP.
 *
 * @param p : packet buffer containing newly received data packet
 * @param interface : The interface (AP or STA) on which the packet was received.
 */
void host_network_process_ethernet_data( /*@only@*/ wiced_buffer_t p, wwd_interface_t interface )
{
    ethernet_header_t * ether_header = (ethernet_header_t *) host_buffer_get_current_piece_data_pointer( p );

    if ( ( interface != WWD_STA_INTERFACE ) ||                                   /* Check that packet came from STA interface */
         ( ether_header->ether_type != SWAP16( ETHER_TYPE_ARP ) ) ||             /* Check ethertype first as it is less costly than memcmp - Only ARP packets need to be received - all other packets are silently ignored */
         ( ( 0 != memcmp( &ether_header->destination, &my_mac, 6 ) ) &&          /* Check if the destination MAC matches ours, or the broadcast value */
           ( 0 != memcmp( &ether_header->destination, &broadcast_mac, 6 ) ) ) )

    {
        host_buffer_release( p, WWD_NETWORK_RX );
        return;
    }

    arp_message_t * arp = (arp_message_t *) &ether_header[1];

    /* Only process ARP replys - Ignore ARP requests, since we do not want anyone to send us any data */
    if ( arp->operation != SWAP16( ARP_OPERATION_REPLY ) )
    {
        host_buffer_release( p, WWD_NETWORK_RX );
        return;
    }

    /* Check if the ARP response is from our destination IP address */
    if ( arp->sender_protocol_address != arp_dest_ip_addr )
    {
        /* Not a response containing the MAC of our destination IP */
        host_buffer_release( p, WWD_NETWORK_RX );
        return;
    }

    /* We now have a MAC for our destination */
    memcpy( arp_mac_buffer_ptr, &arp->sender_hardware_address, 6 );

    arp_complete = 1;
}


/*********************************************END OF FILE**********************/

